tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "michaeleisel/zld"
tap "railwaycat/emacsmacport"
brew "bat"
brew "doctl"
brew "elixir"
brew "exa"
brew "git"
brew "glib"
brew "grpcurl"
brew "htop"
brew "hyperfine"
brew "krb5"
brew "libpq", link: true
brew "md5sha1sum"
brew "mold"
brew "nodebrew"
brew "openssl@3"
brew "pkg-config"
brew "sqlite"
brew "python@3.8"
brew "starship"
brew "telnet"
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "aws/tap/aws-sam-cli"
cask "chromedriver"
cask "deepl"
cask "docker"
cask "emacs-mac"
cask "font-fira-code-nerd-font"
cask "google-chrome"
cask "google-japanese-ime"
cask "insomnia"
cask "iterm2"
cask "multipass"
cask "spectacle"
cask "visual-studio-code"
