tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "michaeleisel/zld"
tap "railwaycat/emacsmacport"
brew "bat"
brew "curl"
brew "exa"
brew "git"
brew "glib"
brew "gnu-time"
brew "grpcurl"
brew "htop"
brew "hyperfine"
brew "libpq", link: true
brew "mold"
brew "nodebrew"
brew "openssl@3", link: false
brew "pkg-config"
brew "starship"
brew "telnet"
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "michaeleisel/zld/zld"
cask "alacritty"
cask "chromedriver"
cask "deepl"
cask "docker"
cask "emacs-mac"
cask "insomnia"
cask "multipass"
cask "visual-studio-code"
