tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

cask_args appdir: "/Applications", fontdir: "${HOME}/Library/Fonts"

cask "1password"
cask "alacritty"
cask "deepl"
cask "docker"
cask "firefox-developer-edition"
cask "font-iosevka-ss09"
cask "hammerspoon"
cask "karabiner-elements"

# GNU programs to replace the BSD ones
brew "coreutils"
brew "binutils"
brew "diffutils"
brew "ed"
brew "findutils"
brew "gawk"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "grep"
brew "gzip"
brew "screen"

# GNU programs existing in macOS but with outdated versions
brew "bash"
brew "bison"
brew "make"
brew "zsh"

# other programs
brew "bash-language-server"
brew "curl"
brew "fzf"
brew "git"
brew "grpcurl"
brew "htop"
brew "libpq", link: true
brew "mold"
brew "nvim"
brew "openssl"
brew "shellcheck"
brew "telnet"
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
