tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "railwaycat/emacsmacport"

brew "bat"
brew "curl"
brew "emacs-mac", args: ["with-imagemagick", "with-modern-icon", "with-no-title-bars", "with-starter"]
brew "exa"
brew "git"
brew "gnu-time"
brew "grpcurl"
brew "htop"
brew "hyperfine"
brew "libpq", link: true
brew "mold"
brew "openssl@3"
brew "starship"
brew "telnet"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

cask_args appdir: "/Applications", fontdir: "${HOME}/Library/Fonts"

cask "alacritty"
cask "deepl"
cask "docker"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "hammerspoon"
cask "karabiner-elements"
cask "visual-studio-code"
